In [74]:
%load_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'    
%sql sqlite:///PS1.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Problem Set 1 [100 points]
=======

### Deliverables:

Submit your queries (and only those) using the `submission_template.txt` file that is posted on Canvas. Follow the instructions on the file! Upload the file at Canvas.


### Instructions / Notes:

* Run the top cell above to load the database `PS1.db` (make sure the database file, `PS1.db`, is in the same directory as this IPython notebook is running in)
* Some of the problems involve _changing_ this database (e.g. deleting rows)- you can always re-download `PS1.db` or make a copy if you want to start fresh!
* You **may** create new IPython notebook cells to use for e.g. testing, debugging, exploring, etc.- this is encouraged in fact!- **just make sure that your final answer for each question is _in its own cell_ and _clearly indicated_**
* When you see `In [*]:` to the left of the cell you are executing, this means that the code / query is _running_.
    * **If the cell is hanging- i.e. running for too long: To restart the SQL connection, you must restart the entire python kernel**
    * To restart kernel using the menu bar: "Kernel >> Restart >> Clear all outputs & restart"), then re-execute the sql connection cell at top
    * You will also need to restart the connection if you want to load a different version of the database file
* Remember:
    * `%sql [SQL]` is for _single line_ SQL queries
    * `%%sql [SQL]` is for _multi line_ SQL queries
* _Have fun!_

Problem 1: Linear Algebra [30 points]
------------------------

Two random 3x3 ($N=3$) matrices have been provided in tables `A` and `B`, having the following schema:
> * `i INT`:   Row index
> * `j INT`:   Column index
> * `val INT`: Cell value

**Note: all of your answers below _must_ work for any _square_ matrix sizes, i.e. any value of $N$**.

Note how the matrices are represented - why do we choose this format?  Run the following queries to see the matrices in a nice format:

In [75]:
%sql SELECT group_concat(val, " , ") AS "A" FROM A GROUP BY i;

 * sqlite:///PS1.db
Done.

[('7 , 5 , 8',), ('10 , 7 , 7',), ('2 , 0 , 5',)]

In [76]:
%sql SELECT group_concat(val, " , ") AS "B" FROM B GROUP BY i;

 * sqlite:///PS1.db
Done.

[('9 , 6 , 10',), ('7 , 6 , 9',), ('1 , 1 , 7',)]

### Part (a): Matrix addition [5 points]

The sum of a matrix $A$ (having dimensions $n\times m$) and a matrix $B$ (having dimensions $n\times m$) is the matrix $C$ (of dimension $n\times m$) having cell at row $i$ and column $j$ equal to:

$C_{ij} = A_{ij} + B_{ij}$

Write a single SQL query to get the sum of $A$ and $B$ (in the same format as $A$ and $B$):

In [77]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

"\nExpected output below- don't re-evaluate this cell!\n\nNOTE: A valid answer must work for ALL inputs of the given type,\nnot just this example.  I.e. do not hardcode around this answer / etc!\n"

In [78]:
%%sql
SELECT A.i, A.j, (A.val + B.val) AS val
FROM A
JOIN B ON A.i = B.i
AND A.j = B.j;

 * sqlite:///PS1.db
Done.

[(0, 0, 16),
 (0, 1, 11),
 (0, 2, 18),
 (1, 0, 17),
 (1, 1, 13),
 (1, 2, 16),
 (2, 0, 3),
 (2, 1, 1),
 (2, 2, 12)]

### Part (b): Dot product [5 points]

The _dot product_ of two vectors

$a = \begin{bmatrix}a_1 & a_2 & \dots & a_n\end{bmatrix}$

and

$b = \begin{bmatrix}b_1 & b_2 & \dots & b_n\end{bmatrix}$

is

$a\cdot b = \sum_{i=1}^n a_ib_i = a_1b_1 + a_2b_2 + \dots + a_nb_n$

Write a _single SQL query_ to take the dot product of the **first column of $A$** and the **second column of $B$.**:

In [79]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

"\nExpected output below- don't re-evaluate this cell!\n\nNOTE: A valid answer must work for ALL inputs of the given type,\nnot just this example.  I.e. do not hardcode around this answer / etc!\n"

In [80]:
%%sql
SELECT sum(A.val * B.val) AS DotProduct
FROM A
JOIN B ON A.i = B.i
WHERE A.j = 0
AND B.j = 1;

 * sqlite:///PS1.db
Done.

[(104,)]

### Part (c): Matrix multiplication [10 points]

The product of a matrix $A$ (having dimensions $n\times m$) and a matrix $B$ (having dimensions $m\times p$) is the matrix $C$ (of dimension $n\times p$) having cell at row $i$ and column $j$ equal to:

$C_{ij} = \sum_{k=1}^m A_{ik}B_{kj}$

In other words, to multiply two matrices, get each cell of the resulting matrix $C$, $C_{ij}$, by taking the _dot product_ of the $i$th row of $A$ and the $j$th column of $B$.

Write a single SQL query to get the matrix product of $A$ and $B$ (in the same format as $A$ and $B$):

In [81]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

"\nExpected output below- don't re-evaluate this cell!\n\nNOTE: A valid answer must work for ALL inputs of the given type,\nnot just this example.  I.e. do not hardcode around this answer / etc!\n"

In [82]:
%%sql 
SELECT A.i, B.j, SUM(A.val * B.val) AS val
FROM A
JOIN B ON A.j = B.i
GROUP BY A.i, B.j;

 * sqlite:///PS1.db
Done.

[(0, 0, 106),
 (0, 1, 80),
 (0, 2, 171),
 (1, 0, 146),
 (1, 1, 109),
 (1, 2, 212),
 (2, 0, 23),
 (2, 1, 17),
 (2, 2, 55)]

### Part (d): Matrix operations [10 points]

In the previous question, we obtained the resulting matrix $C$ by multiplying two matrices $A$ and $B$. Each element in $C$ was computed using the _dot product_ of the $i$th row of $A$ and the $j$th column of $B$.

Write a _single SQL query_ that computes the resulting matrix $R$, which is the **square** of matrix $A$ plus 2 times the **square** of matrix $C$, in other words, $R = A \cdot A + 2 \cdot (C \cdot C) = A \cdot A + 2 \cdot ((A \cdot B) \cdot (A \cdot B))$:

In [83]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

"\nExpected output below- don't re-evaluate this cell!\n\nNOTE: A valid answer must work for ALL inputs of the given type,\nnot just this example.  I.e. do not hardcode around this answer / etc!\n"

In [84]:
%%sql
WITH A_2 AS (
    SELECT A1.i, A2.j, SUM(A1.val * A2.val) AS val
    FROM A A1
    JOIN A A2 ON A1.j = A2.i
    GROUP BY A1.i, A2.j
),
AB AS (
    SELECT A.i, B.j, SUM(A.val * B.val) AS val
    FROM A
    JOIN B ON A.j = B.i
    GROUP BY A.i, B.j
),
AB_2 AS(
    SELECT AB1.i, AB2.j, SUM(AB1.val * AB2.val) AS val
    FROM AB AB1
    JOIN AB AB2 ON AB1.j = AB2.i 
    GROUP BY AB1.i, AB2.j
)
SELECT A_2.i, A_2.j, (A_2.val + 2 * AB_2.val) AS val
FROM A_2
JOIN AB_2 ON A_2.i = AB_2.i
AND A_2.j = AB_2.j;

 * sqlite:///PS1.db
Done.

[(0, 0, 53813),
 (0, 1, 40284),
 (0, 2, 89113),
 (1, 0, 72686),
 (1, 1, 54429),
 (1, 2, 119632),
 (2, 0, 12394),
 (2, 1, 9266),
 (2, 2, 21165)]

Problem 2: The Sales Database [35 points]
----------------------------------------------

We've prepared and loaded a dataset related to sales data from a company. The dataset has the following schema:

> `Holidays (WeekDate, IsHoliday)`

> `Stores (Store, Type, Size)`

> `TemporalData(Store, WeekDate, Temperature, FuelPrice, CPI, UnemploymentRate)`

> `Sales (Store, Dept, WeekDate, WeeklySales)`

Before you start writing queries on the database, find the schema and the constraints (keys, foreign keys).

### Part (a): Sales during Holidays [10 points]

Using a _single SQL query_, find the store(s) with the largest overall sales during holiday weeks. Further requirements:
* Use the `WITH` clause before the main body of the query to compute a subquery if necessary.
* Return a relation with schema `(Store, AllSales)`.

Write your query here:

In [85]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

"\nExpected output below- don't re-evaluate this cell!\n\nNOTE: A valid answer must work for ALL inputs of the given type,\nnot just this example.  I.e. do not hardcode around this answer / etc!\n"

In [86]:
%sql SELECT * FROM Holidays LIMIT 5;

 * sqlite:///PS1.db
Done.

[('2010-02-05', 'FALSE'),
 ('2010-02-12', 'TRUE'),
 ('2010-02-19', 'FALSE'),
 ('2010-02-26', 'FALSE'),
 ('2010-03-05', 'FALSE')]

In [87]:
%sql SELECT * FROM Stores LIMIT 5;

 * sqlite:///PS1.db
Done.

[(1, 'A', 151315),
 (2, 'A', 202307),
 (3, 'B', 37392),
 (4, 'A', 205863),
 (5, 'B', 34875)]

In [88]:
%sql SELECT * FROM SALES LIMIT 5;

 * sqlite:///PS1.db
Done.

[(1, 1, '2010-02-05', 24924.5),
 (1, 1, '2010-02-12', 46039.49),
 (1, 1, '2010-02-19', 41595.55),
 (1, 1, '2010-02-26', 19403.54),
 (1, 1, '2010-03-05', 21827.9)]

In [89]:
%%sql
WITH Holi_Sales AS (
    SELECT S.Store, SUM(S.WeeklySales) AS AllSales
    FROM Sales S
    JOIN Holidays H ON S.WeekDate = H.WeekDate
    WHERE H.IsHoliday = "TRUE"
    GROUP BY S.Store
)
SELECT Store, AllSales
FROM Holi_Sales
WHERE AllSales = (SELECT Max(AllSales) FROM Holi_Sales);

 * sqlite:///PS1.db
Done.

[(20, 22490350.81)]

### Part (b): When Holidays do not help Sales [15 points]

Using a _single SQL query_, compute the **number** of non-holiday weeks that had larger sales than the overall average sales during holiday weeks. Further requirements:
* Use the `WITH` clause before the main body of the query to compute a subquery if necessary.
* Return a relation with schema `(NumberNonHolidays)`.

Write your query here:

In [90]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

"\nExpected output below- don't re-evaluate this cell!\n\nNOTE: A valid answer must work for ALL inputs of the given type,\nnot just this example.  I.e. do not hardcode around this answer / etc!\n"

In [91]:
# %%sql
# SELECT S.WeekDate, SUM(S.WeeklySales) AS NHo_Sales
# FROM Sales S 
# JOIN Holidays H ON S.WeekDate = H.WeekDate
# AND H.IsHoliday = "FALSE"
# GROUP BY S.WeekDate
# LIMIT 3;

In [92]:
# %%sql
# SELECT S.WeekDate, AVG(S.WeeklySales) AS Ho_avg_Sales
# FROM Sales S
# JOIN  Holidays H ON S.WeekDate = H.WeekDate
# AND H.IsHoliday = "TRUE"
# GROUP BY S.WeekDate
# LIMIT 3;

In [111]:
%%sql
WITH NonHoli_Sales AS (
    SELECT S.WeekDate, SUM(S.WeeklySales) AS NHo_Sales
    FROM Sales S
    WHERE EXISTS (
        SELECT * FROM Holidays H WHERE S.WeekDate = H.WeekDate AND H.IsHoliday = "FALSE"
    )
    GROUP BY S.WeekDate
),
Holi_Avg_Sales AS (
    SELECT AVG(TotalSales) AS Ho_avg_Sales
    FROM (
        SELECT S.WeekDate, SUM(S.WeeklySales) AS TotalSales
        FROM Sales S
        WHERE EXISTS (
            SELECT * FROM Holidays H WHERE S.WeekDate = H.WeekDate AND H.IsHoliday = "TRUE"
        )
        GROUP BY S.WeekDate
    ) AS HolidayTotals
)
SELECT COUNT(*) AS NumberNonHolidays
FROM NonHoli_Sales N
WHERE N.NHo_Sales > (SELECT Ho_avg_Sales FROM Holi_Avg_Sales);

 * sqlite:///PS1.db
Done.

[(50529955.156,)]

### Part (c): Total Summer Sales [10 points]

Using a _single SQL query_, compute the average winter sales (months 12,1,and 2) for each type of store. Further requirements:
* Return a relation with schema `(type, AvgSales)`.

*Hint:* SQLite3 does not support native operations on the DATE datatype. To create a workaround, you can use the `LIKE` predicate and the string concatenation operator (||). You can also use the substring operator that SQLite3 supports (`substr`).

Write your query here:

In [94]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

"\nExpected output below- don't re-evaluate this cell!\n\nNOTE: A valid answer must work for ALL inputs of the given type,\nnot just this example.  I.e. do not hardcode around this answer / etc!\n"

In [95]:
%%sql
SELECT S.Type, AVG(SL.WeeklySales) AS AvgSales
FROM Sales SL
JOIN Stores S ON S.Store = SL.Store
WHERE substr(SL.WeekDate, 6, 2) IN ('12', '01', '02')
GROUP BY S.Type;

 * sqlite:///PS1.db
Done.

[('A', 20884.924470966464),
 ('B', 12858.744532384506),
 ('C', 9583.168305027557)]

Problem 3: The Traveling SQL Server Salesman Problem [35 points]
--------------------------------------------------

SQL Server salespeople are lucky as far as traveling salespeople go- they only have to sell one or two big enterprise contracts, at one or two offices in Wisconsin, in order to make their monthly quota!

Answer the following questions using the table of streets connecting company office buildings.

**Note that for convenience all streets are included _twice_, as $A \rightarrow B$ and $B \rightarrow A$.  This should make some parts of the problem easier, but remember to take it into account!**

In [96]:
%sql SELECT * FROM streets LIMIT 4;

 * sqlite:///PS1.db
Done.

[(0, 'F', 'UW-Madison', 'DooHickey Collective', 7),
 (0, 'R', 'DooHickey Collective', 'UW-Madison', 7),
 (1, 'F', 'DooHickey Collective', 'Gizmo Corp', 2),
 (1, 'R', 'Gizmo Corp', 'DooHickey Collective', 2)]

### Part (a): One-hop, two-hop, three-hop... [15 points]

Our salesperson has stopped at UW-Madison, to steal some cool new RDBMS technology from CS564-ers, and now wants to go sell it to a company _within 10 miles of UW-Madison_ and _passing through no more than 3 distinct streets_.  Write a single query, not using `WITH` (see later on), to find all such companies.

Your query should return the schema `(company, distance)` where distance is cumulative from UW-Madison.

Write your query here:

In [97]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

"\nExpected output below- don't re-evaluate this cell!\n\nNOTE: A valid answer must work for ALL inputs of the given type,\nnot just this example.  I.e. do not hardcode around this answer / etc!\n"

In [98]:
%%sql
SELECT DISTINCT
    st1.B AS company,
    st1.d AS distance
FROM streets AS st1
WHERE st1.A = 'UW-Madison' AND st1.d <= 10

UNION

SELECT DISTINCT
    st2.B AS company,
    (st1.d + st2.d) AS distance
FROM streets AS st1
JOIN streets AS st2 ON st1.B = st2.A
WHERE st1.A = 'UW-Madison' AND (st1.d + st2.d) <= 10

UNION

SELECT DISTINCT
    st3.B AS company,
    (st1.d + st2.d + st3.d) AS distance
FROM streets AS st1
JOIN streets AS st2 ON st1.B = st2.A
JOIN streets AS st3 ON st2.B = st3.A
WHERE st1.A = 'UW-Madison' AND (st1.d + st2.d + st3.d) <= 10;

 * sqlite:///PS1.db
Done.

[('DooHickey Collective', 7),
 ('DooHickey Corp', 9),
 ('Gadget Collective', 9),
 ('Gadget Corp', 6),
 ('Gizmo Corp', 9),
 ('Widget Industries', 10)]

### Part (b): A stop at the Farm [10 points]

Now, our salesperson is out in the field, and wants to see all routes- and their distances- which will take him/her from a company $A$ to a company $B$, with the following constraints:
* The route must pass through UW-Madison (in order to pick up new RDBMS tech to sell!)
* $A$ and $B$ must _each individually_ be within 2 hops of UW-Madison
* $A$ and $B$ must be different companies
* _The total distance must be $<= 15$_
* Do not use `WITH`
* If you return a path $A \rightarrow B$, _do not include_ $B \rightarrow A$ in your answer!

In order to make your answer a bit cleaner, you may split into two queries, one of which creates a `VIEW`.  A view is a virtual table based on the output set of a SQL query.  A view can be used just like a normal table- the only difference under the hood is that the DBMS re-evaluates the query used to generate it each time a view is queried by a user (thus the data is always up-to date!)

Here's a simple example of a view:

In [99]:
%%sql 
DROP VIEW IF EXISTS short_streets;
CREATE VIEW short_streets AS 
SELECT A, B, d FROM streets WHERE d < 3;
SELECT * FROM short_streets LIMIT 3;

 * sqlite:///PS1.db
Done.
Done.
Done.

[('DooHickey Collective', 'Gizmo Corp', 2),
 ('Gizmo Corp', 'DooHickey Collective', 2),
 ('Gizmo Corp', 'Widget Industries', 1)]

Write your query or queries here:

In [100]:

"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

"\nExpected output below- don't re-evaluate this cell!\n\nNOTE: A valid answer must work for ALL inputs of the given type,\nnot just this example.  I.e. do not hardcode around this answer / etc!\n"

In [101]:
%%sql
DROP VIEW IF EXISTS neighbors;
CREATE VIEW neighbors AS 

SELECT DISTINCT st.A, st.d
FROM streets st WHERE st.B = "UW-Madison"

UNION 

SELECT DISTINCT st.B, st.d
FROM streets st WHERE st.A = "UW-Madison"

UNION 

SELECT DISTINCT st1.A, (st1.d + st2.d) 
FROM streets st1
JOIN streets st2 ON st1.B = st2.A
WHERE st2.B = "UW-Madison"

UNION

SELECT DISTINCT st2.B, (st1.d + st2.d)
FROM streets st1
JOIN streets st2 ON st1.A = st2.B
WHERE st2.A = "UW-Madison";

 * sqlite:///PS1.db
Done.
Done.

[]

In [114]:
%sql SELECT * FROM neighbors;

 * sqlite:///PS1.db
Done.

[('DooHickey Collective', 'UW-Madison', 7),
 ('Gadget Collective', 'UW-Madison', 9),
 ('Gadget Corp', 'UW-Madison', 6),
 ('UW-Madison', 'DooHickey Corp', 9),
 ('UW-Madison', 'Gadget Industries', 15),
 ('UW-Madison', 'Gizmo Corp', 9),
 ('UW-Madison', 'GizmoWorks', 12),
 ('UW-Madison', 'UW-Madison', 12),
 ('UW-Madison', 'UW-Madison', 14),
 ('UW-Madison', 'UW-Madison', 18)]

In [103]:
%%sql
SELECT 
    n1.A AS company_1, 
    n2.A AS company_2, 
    MIN(n1.d + n2.d) AS distance   
FROM 
    neighbors n1
JOIN 
    neighbors n2 ON n1.A < n2.A 
WHERE 
    (n1.d + n2.d) <= 15
GROUP BY 
    company_1, company_2
ORDER BY 
    company_1, company_2;

 * sqlite:///PS1.db
Done.

[('DooHickey Collective', 'Gadget Corp', 13),
 ('DooHickey Corp', 'Gadget Corp', 15),
 ('Gadget Collective', 'Gadget Corp', 15),
 ('Gadget Corp', 'Gizmo Corp', 15)]

Version 2 of part(b)

In [104]:
%%sql
DROP VIEW IF EXISTS neighbors;
CREATE VIEW neighbors AS 
SELECT DISTINCT A, B, d FROM streets WHERE B = "UW-Madison"

UNION 

SELECT DISTINCT B, A, d FROM streets WHERE A = "UW-Madison"

UNION 

SELECT DISTINCT s1.A, s2.B, (s1.d + s2.d) AS d 
FROM streets s1 
JOIN streets s2 ON s1.B = s2.A
WHERE s1.A = "UW-Madison"

UNION 

SELECT DISTINCT s1.B, s2.A, (s1.d + s2.d) AS d 
FROM streets s1 
JOIN streets s2 ON s1.A = s2.B
WHERE s1.B = "UW-Madison";

 * sqlite:///PS1.db
Done.
Done.

[]

In [105]:
%sql SELECT * FROM neighbors LIMIT 5;

 * sqlite:///PS1.db
Done.

[('DooHickey Collective', 'UW-Madison', 7),
 ('Gadget Collective', 'UW-Madison', 9),
 ('Gadget Corp', 'UW-Madison', 6),
 ('UW-Madison', 'DooHickey Corp', 9),
 ('UW-Madison', 'Gadget Industries', 15)]

In [106]:
%%sql 
SELECT n1.A AS company_1, n2.B AS company_2, (n1.d+n2.d) AS distance
FROM neighbors n1
JOIN neighbors n2 ON n1.B = "UW-Madison"
AND n2.A = "UW-Madison"
WHERE (n1.d + n2.d) <= 15;

 * sqlite:///PS1.db
Done.

[('Gadget Corp', 'DooHickey Corp', 15), ('Gadget Corp', 'Gizmo Corp', 15)]

### Part (c): Finding Triangles [10 points]

Finally, our salesperson wants to find the longest route that goes from some company $A$ to company $B$ to company $C$ and then back to company $A$. Also, the following constraints must hold:
* $A$, $B$, $C$ must be different companies
* Do not use `WITH` 
* Output only the length of the longest route

Write your query here:

In [107]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

"\nExpected output below- don't re-evaluate this cell!\n\nNOTE: A valid answer must work for ALL inputs of the given type,\nnot just this example.  I.e. do not hardcode around this answer / etc!\n"

In [116]:
%%sql
SELECT MAX(st1.d + st2.d + st3.d) AS LongestDistance
FROM streets st1
JOIN streets st2 ON st1.B = st2.A
JOIN streets st3 ON st2.B = st3.A
WHERE st3.B = st1.A
AND st1.A <> st2.B
AND st2.A <> st3.B;

 * sqlite:///PS1.db
Done.

[(18,)]